### 7. 데이터 합치기와 재구성
### 7.1 멀티 인덱스

In [1]:
import numpy as np
import pandas as pd

In [3]:
# 인덱스는 단일x 멀티 o
s = pd.Series([85,90,78,92,88,75],
             index=[['1학년','1학년','1학년','2학년','2학년','2학년'],
                    ['a반','a반','b반','a반','b반','b반']]
             )

In [4]:
s

1학년  a반    85
     a반    90
     b반    78
2학년  a반    92
     b반    88
     b반    75
dtype: int64

인덱스로 값 꺼내기

In [10]:
# 시리즈에서 1학년만 꺼내기
s['1학년']
s.index
s.loc[('1학년', 'a반')]
s.loc[('1학년',['a반','b반'])]
s.index

MultiIndex([('1학년', 'a반'),
            ('1학년', 'a반'),
            ('1학년', 'b반'),
            ('2학년', 'a반'),
            ('2학년', 'b반'),
            ('2학년', 'b반')],
           )

In [11]:
# 매출 데이터를 담은 시리즈 생성
# 데이터: 매출
# 인덱스: (멀티) 지역-지정
# 1단계는 지역
# 2단계는 지점
s = pd.Series([120,100,90,80],
              index=[['서울','서울','부산','부산'],
                    ['강남점','강북점','해운대점','서면점']]
             )

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [15]:
s.index
# s['서울']
s.loc[('부산', '해운대점')]

np.int64(90)

In [21]:
# 데이터의 개수와 인덱스의 개수가 맞지 않으면, 에러남
s = pd.Series([300,250,500,400],
              index=[['전자제품','전자제품', '식품', '식품'],
                    ['노트북','휴대폰','라면','과자']]
             )
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [24]:
s.index
s['전자제품']

노트북    300
휴대폰    250
dtype: int64

In [26]:
s.loc[('식품', '라면')]

np.int64(500)

In [27]:
s = pd.Series([40,35,50,45],
              index=[['1학년','1학년', '2학년', '2학년'],
                    ['국어','수학','국어','수학']]
             )
s

1학년  국어    40
     수학    35
2학년  국어    50
     수학    45
dtype: int64

In [28]:
s.index

MultiIndex([('1학년', '국어'),
            ('1학년', '수학'),
            ('2학년', '국어'),
            ('2학년', '수학')],
           )

In [29]:
s['1학년']

국어    40
수학    35
dtype: int64

In [30]:
s.loc[('2학년','수학')]

np.int64(45)

In [31]:
df = pd.DataFrame([[50,60],[70,80],[100,110],[120,130]])
df

     0    1
0   50   60
1   70   80
2  100  110
3  120  130

In [36]:
df = pd.DataFrame([[120,45],[95,60],[150,70],[110,55]],
                 index= [['중앙도서관','중앙도서관','시립도서관','시립도서관'],
                         ['1월','2월','1월','2월']],
                 columns=['소설','과학'])
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [37]:
df = pd.DataFrame([[320,280],[210,230],[400,390],[180,200]],
                 index= [['2022년','2022년','2023년','2023년'],
                         ['SUV','세단','SUV','세단']],
                 columns=['1분기','2분기'])
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [48]:
print(df.index)
print(df.columns)

MultiIndex([('2022년', 'SUV'),
            ('2022년',  '세단'),
            ('2023년', 'SUV'),
            ('2023년',  '세단')],
           )
Index(['1분기', '2분기'], dtype='object')

In [49]:
df.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [51]:
df.loc['2023년', '세단']

1분기    180
2분기    200
Name: (2023년, 세단), dtype: int64

#### 7.2 데이터 합치기
merge
- 두개의 데이터 프레임을 하나로 합치는 함수
- 기준컬럼이 맞으면 연결

In [104]:
# 학생 데이터를 담아서 데이터 프레임 생성
# pd.DataFrame(2차원배열)
# pd.DataFrame(dic)
df1 = pd.DataFrame( { '학번': [1,2,3], '이름':['철수','영희','민수'] } )
print(df1)
# 시험 점수 데이터를 담아서 데이터프레임 생성
df2 = pd.DataFrame( { '학번': [1,2,4], '점수':[90,85,70] } )
print(df2)

   학번  이름
0   1  철수
1   2  영희
2   3  민수
   학번  점수
0   1  90
1   2  85
2   4  70

In [62]:
df1 = pd.DataFrame( { '고객ID': [101,102,103], '이름':['철수','영희','민수'] } )
df1
df2 = pd.DataFrame( { '고객ID': [101,104,102], '상품':['노트북','청소기','책'] } )
df2

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [55]:
df2

   학번  점수
0   1  90
1   2  85
2   4  70

merge의 종류
- inner join: 양쪽 데이터에서 공통된 부분만 가지고옴
- left join: 왼쪽 데이터는 모두 가지고 오고, 오른쪽은 겹치는 부분만
- right join: 오른쪽 데이터는 모두 가지고 오고, 오른쪽은 겹치는 부분만
- outer join: 양쪽 데이터를 모두 가지고 옴

In [56]:
# 학생정보와 시험점수 합치기
# pd.merge(데이터1, 데이터2, 공통컬럼)
pd.merge(df1, df2, on='학번')

   학번  이름  점수
0   1  철수  90
1   2  영희  85

In [57]:
pd.merge(df1, df2, on='학번', how='left')

   학번  이름    점수
0   1  철수  90.0
1   2  영희  85.0
2   3  민수   NaN

In [58]:
pd.merge(df1, df2, on='학번', how='right')

   학번   이름  점수
0   1   철수  90
1   2   영희  85
2   4  NaN  70

In [60]:
pd.merge(df1, df2, on='학번', how='outer')

   학번   이름    점수
0   1   철수  90.0
1   2   영희  85.0
2   3   민수   NaN
3   4  NaN  70.0

In [71]:
df1 = pd.DataFrame( { '고객ID': [101,102,103], '이름':['철수','영희','민수'] } )
df1

   고객ID  이름
0   101  철수
1   102  영희
2   103  민수

In [70]:
df2 = pd.DataFrame( { '고객ID': [101,104,102], '상품':['노트북','청소기','책'] } )
df2

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [72]:
pd.merge(df1, df2, on='고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [73]:
df1 = pd.DataFrame( { '사번': [1,2,3], '이름':['홍길동','임꺽정','이몽룡'] } )
df1

   사번   이름
0   1  홍길동
1   2  임꺽정
2   3  이몽룡

In [74]:
df2 = pd.DataFrame( { '사번': [1,3], '부서':['영업','개발'] } )
df2

   사번  부서
0   1  영업
1   3  개발

In [76]:
pd.merge(df1, df2, on='사번', how='outer' )

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [82]:
df1 = pd.DataFrame( { '상품코드': ['A1','A2','A3'], '상품명':['노트북','청소기','책상'] } )
df1
df2 = pd.DataFrame( { '상품코드': ['A2','A3','A4'], '재고':[5,8,10] } )
df2

  상품코드  재고
0   A2   5
1   A3   8
2   A4  10

In [83]:
pd.merge(df1, df2, on='상품코드', how='right' )

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [84]:
df1 = pd.DataFrame( { '학번': [1,2,3], '이름':['지훈','서연','민지'] } )
df1
df2 = pd.DataFrame( { '학번': [2,4], '동아리':['축구부','합창단'] } )
df2

   학번  동아리
0   2  축구부
1   4  합창단

In [86]:
pd.merge(df1, df2, on='학번', how='outer')

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

concat
- 여러개의 데이터를 이어 붙이는 함수
- 조건없이 그냥 이어붙임
- 방향: 위아래 / 옆으로

In [105]:
df1

   학번  이름
0   1  철수
1   2  영희
2   3  민수

In [106]:
df2

   학번  점수
0   1  90
1   2  85
2   4  70

In [111]:
pd.concat([df1, df2], axis=1)

   학번  이름  학번  점수
0   1  철수   1  90
1   2  영희   2  85
2   3  민수   4  70

In [113]:
# pd.concat(리스트, [index 옵션])
# ignore_index=True => 기존 인덱스를 무시하고 순차적으로 부여
pd.concat([df1, df2], ignore_index=True)

   학번   이름    점수
0   1   철수   NaN
1   2   영희   NaN
2   3   민수   NaN
3   1  NaN  90.0
4   2  NaN  85.0
5   4  NaN  70.0

In [114]:
df1 = pd.DataFrame({'사번': [1,2], '이름':['홍길동','임꺽정']})
df1

   사번   이름
0   1  홍길동
1   2  임꺽정

In [115]:
df2 = pd.DataFrame({'부서': ['영업','개발']})
df2

   부서
0  영업
1  개발

In [118]:
pd.concat([df1, df2], axis=1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [122]:
df1 = pd.DataFrame({'매출': [100,200]})
df1
df2 = pd.DataFrame({'매출': [150,250]})
df2
df3 = pd.DataFrame({'매출': [300,400]})
df3

    매출
0  300
1  400

In [126]:
pd.concat([df1, df2, df3], ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [130]:
df1 = pd.DataFrame({'이름': ['철수','영희'], '국어': [85,90]})
df1
df2 = pd.DataFrame({'이름': ['민수','지연'], '수학': [78,92]})
df2

   이름  수학
0  민수  78
1  지연  92

In [133]:
pd.concat([df1,df2], axis=1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

#### 7.3 데이터 재구성

피봇(pivot)
- 행열을 바꿔서 표를 재구성하는 함수

In [148]:
# 학생의 시험 점수를 데이터프레임에 저장
df = pd.DataFrame({'이름':['철수', '영희','철수','영희'],
                   '과목':['국어', '국어','수학','수학'],
                   '점수':[90, 85, 80, 95]
                  })
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [136]:
# 이 표는 데이터를 저장, 수정하기에는 좋지만
# 조회하는 건 불편함

In [149]:
# 이 데이터를 성적표 형태로 변경
# pivot(인덱스, 컬럼, 데이터)
# 원본 데이터의 컬럼 중에서 선택
df.pivot(index='이름', columns='과목', values='점수')
df

   이름  과목  점수
0  철수  국어  90
1  영희  국어  85
2  철수  수학  80
3  영희  수학  95

In [151]:
df = pd.DataFrame({'카테고리':['식품', '식품','가전','가전'],
                   '월':['1월', '2월','1월','2월'],
                   '매출':[200, 250, 500, 550]
                  })
df

  카테고리   월   매출
0   식품  1월  200
1   식품  2월  250
2   가전  1월  500
3   가전  2월  550

In [154]:
df.pivot(index='카테고리', columns='월', values='매출')

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [155]:
df = pd.DataFrame({'도서관':['중앙', '중앙','시립','시립'],
                   '장르':['소설', '과학','소설','과학'],
                   '대출건수':[120, 45, 95, 60]
                  })
df

  도서관  장르  대출건수
0  중앙  소설   120
1  중앙  과학    45
2  시립  소설    95
3  시립  과학    60

In [156]:
df.pivot(index='도서관', columns='장르', values='대출건수')

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [157]:
df = pd.DataFrame({'지점':['서울', '서울','부산','부산'],
                   '객실유형':['싱글룸', '더블룸','싱글룸','더블룸'],
                   '예약건수':[45, 30, 50, 35]
                  })
df

   지점 객실유형  예약건수
0  서울  싱글룸    45
1  서울  더블룸    30
2  부산  싱글룸    50
3  부산  더블룸    35

In [158]:
df.pivot(index='지점', columns='객실유형', values='예약건수')

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45